In [ ]:
import pandas as pd
import selenium
import webdriver_manager
from datetime import datetime 

from selenium.webdriver.support.ui import WebDriverWait
from selenium.webdriver.common.by import By
from selenium.webdriver.support import expected_conditions as EC

from selenium import webdriver  # Selenium es una herramienta para automatizar la interacción con navegadores web.
from webdriver_manager.chrome import ChromeDriverManager  # ChromeDriverManager gestiona la instalación del controlador de Chrome.
from selenium.webdriver.common.keys import Keys  # Keys es útil para simular eventos de teclado en Selenium.
from selenium.webdriver.support.ui import Select  # Select se utiliza para interactuar con elementos <select> en páginas web.
from selenium.webdriver.support import expected_conditions as EC 
from time import sleep
import pandas as pd
from selenium import webdriver

from tqdm import tqdm
import os
from bs4 import BeautifulSoup
import requests
import re

import zipfile
import shutil

import os


import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns

import re

pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

import json
# Ignorar warings
import warnings
warnings.filterwarnings("ignore")

import dotenv
from dotenv import load_dotenv
load_dotenv()

import psycopg2
from psycopg2 import sql
pd.set_option('display.max_columns', None)

import sys
sys.path.append("../")

In [ ]:
df_wallapop=pd.read_csv("../datos/datos_wallapop.csv", index_col= "Unnamed: 0" )
df_seguridad=pd.read_csv("../datos/datos_seguridad.csv", index_col= "Unnamed: 0" )
df_datos_modelos_nuevos=pd.read_csv("../datos/datos_modelos_nuevos.csv", index_col= "Unnamed: 0" )
df_segunda_mano=pd.read_csv("../datos/datos_segunda_mano.csv", index_col= "Unnamed: 0")

In [ ]:
df_wallapop.head(4)

,id_wallapop,descripcion,precio,latitud,longitud,ciudad,provincia
0,1,nisan almera tino del 2004 ba por cadena le ve...,2200,40.301646,-3.441828,Arganda del Rey,Madrid
1,2,vendo mi coche en perfecto estado de motor y d...,6500,40.620256,-3.910636,Hoyo de Manzanares,Madrid
2,3,coche usado por mi mujer para ir a trabajar.\n...,11500,40.494190,-3.961537,Villanueva del Pardillo,Madrid
3,4,"se vende nissan patrol k260 embrague nuevo , b...",4500,40.419014,-3.707443,Madrid,Madrid

In [ ]:
df_seguridad.head(4)

In [ ]:
df_datos_modelos_nuevos.head(4)

In [ ]:
df_segunda_mano.head(4)

INICIO CREACIÓN DE TABLAS (agregando)

ANIO

In [ ]:
lista_viejo=df_segunda_mano["anio"].unique()
lista_nuevo=df_datos_modelos_nuevos["anio"].unique()
lista_seg=df_seguridad["anio"].unique()
lista_anios= []
lista_anios.extend(lista_seg)
lista_anios.extend(lista_nuevo)
lista_anios.extend(lista_viejo)

In [ ]:
df_anios=pd.DataFrame(lista_anios)
df_anios.duplicated().sum()

np.int64(15)

In [ ]:
df_anios.drop_duplicates(inplace=True)
df_anios.reset_index(drop=True, inplace=True)
df_anios.duplicated().sum()
df_anios.index=df_anios.index+1
df_anios.reset_index(inplace=True)
dicc_anios={
            "index": "id_anio",
            0 : "anio"}
df_anios.columns=df_anios.columns.map(dicc_anios)   
df_anios.head()

   id_anio  anio
0        1  2011
1        2  2012
2        3  2013
3        4  2014
4        5  2015

MOTOR

In [ ]:
lista_viejo=df_segunda_mano["motor"].unique()
lista_nuevo=df_datos_modelos_nuevos["motor"].unique()
lista_motores= []
lista_motores.extend(lista_nuevo)
lista_motores.extend(lista_viejo)

In [ ]:
df_motores=pd.DataFrame(lista_motores)
df_motores.duplicated().sum()

np.int64(2)

In [ ]:
df_motores.drop_duplicates(inplace=True)
df_motores.reset_index(drop=True, inplace=True)
df_motores.index=df_motores.index+1
df_motores.reset_index(inplace=True)
dicc_motores={
            "index": "id_motor",
            0 : "motor"}
df_motores.columns=df_motores.columns.map(dicc_motores)   
df_motores.head()

   id_motor          motor
0         1  MHEV Gasolina
1         2   HEV Gasolina
2         3       Gasolina
3         4      Eléctrico
4         5         Diesel

POTENCIA

In [ ]:
lista_viejo=df_segunda_mano["potencia"].unique()
lista_nuevo=df_datos_modelos_nuevos["potencia"].unique()
lista_potencias= []
lista_potencias.extend(lista_nuevo)
lista_potencias.extend(lista_viejo)

In [ ]:
df_potencias=pd.DataFrame(lista_potencias)
df_potencias.duplicated().sum()

np.int64(10)

In [ ]:
df_potencias.drop_duplicates(inplace=True)
df_potencias.reset_index(drop=True, inplace=True)
df_potencias.index=df_potencias.index+1
df_potencias.reset_index(inplace=True)
dicc_potencias={
            "index": "id_potencia",
            0 : "potencia"}
df_potencias.columns=df_potencias.columns.map(dicc_potencias)   
df_potencias.head()

   id_potencia  potencia
0            1       140
1            2       158
2            3       190
3            4       114
4            5       143

EQUIPAMIENTOS SEGURIDAD

In [ ]:
lista_seg1=df_seguridad["estabilidad_electronica"].unique()
lista_seg2=df_seguridad["aviso_choque_frontal"].unique()
lista_seg3=df_seguridad["aviso_desvio_carril"].unique()
lista_equipamientos= []
lista_equipamientos.extend(lista_seg1)
lista_equipamientos.extend(lista_seg2)
lista_equipamientos.extend(lista_seg3)

In [ ]:
df_equipamientos=pd.DataFrame(lista_equipamientos)
df_equipamientos.duplicated().sum()

np.int64(6)

In [ ]:
df_equipamientos.drop_duplicates(inplace=True)
df_equipamientos.reset_index(drop=True, inplace=True)
df_equipamientos.index=df_equipamientos.index+1
df_equipamientos.reset_index(inplace=True)
dicc_equipamientos={
            "index": "id_equipamiento",
            0 : "equipamiento"}
df_equipamientos.columns=df_equipamientos.columns.map(dicc_equipamientos)   
df_equipamientos

   id_equipamiento         equipamiento
0                1             Standard
1                2             Optional
2                3                   No
3                4  Standard & Optional

CONTINUACION CREACION DE TABLAS

PROVINCIA

In [ ]:
df_provincias= pd.DataFrame(df_datos_modelos_nuevos["provincia"].unique())
df_provincias.index=df_provincias.index+1
df_provincias.reset_index(inplace=True)

In [ ]:
dicc_provincias={
            "index": "id_provincia",
            0 : "provincia"}
df_provincias.columns=df_provincias.columns.map(dicc_provincias)  
df_provincias

   id_provincia provincia
0             1    Madrid

TIPO

In [ ]:
df_cambio_marcha= pd.DataFrame(df_segunda_mano["tipo"].unique())
df_cambio_marcha.index=df_cambio_marcha.index+1
df_cambio_marcha.reset_index(inplace=True)

In [ ]:
dicc_tipos={
            "index": "id_cambio",
            0 : "tipo"}
df_cambio_marcha.columns=df_cambio_marcha.columns.map(dicc_tipos)  
df_cambio_marcha

   id_cambio        tipo
0          1      Manual
1          2  Automático

MODELO

In [ ]:
df_modelos= pd.DataFrame(df_datos_modelos_nuevos["modelo"].unique())
df_modelos.index=df_modelos.index+1
df_modelos.reset_index(inplace=True)

In [ ]:
dicc_modelos={
            "index": "id_modelo",
            0 : "modelo"}
df_modelos.columns=df_modelos.columns.map(dicc_modelos)  
df_modelos.head()

   id_modelo                  modelo
0          1          Nissan Qashqai
1          2  Nissan Qashqai híbrido
2          3             Nissan Juke
3          4     Nissan Juke híbrido
4          5          Nissan X-Trail

AHORA TOCA SUSTITUIR LOS IDS EN LAS TABLAS GRANDES

In [ ]:
df_segunda_mano.head(3)

,id_segunda_mano,version,kilometraje,tipo,anio,motor,potencia,precio,provincia
0,1,Nissan Qashqai 1.2 DIG-T Acenta 4x2,121649,Manual,2015,Gasolina,116,11480,Madrid
1,2,Nissan Juke 1.5dCi Visia,260000,Manual,2012,Diésel,110,6500,Madrid
2,3,Nissan Qashqai DIG-T 103kW (140CV) mHEV 4x2 Ac...,11290,Manual,2023,Electro/Gasolina,140,22000,Madrid

In [ ]:
df_datos_modelos_nuevos.head(3)

,id_modelo_nuevo,version,puertas,potencia,consumo,motor,precio,modelo,provincia,anio
0,1,NISSAN QASHQAI 1.3 DIG-T MHEV 103KW (140CV) AC...,5,140,6.3,MHEV Gasolina,31200,Nissan Qashqai,Madrid,2024
1,2,NISSAN QASHQAI (O)1.3 DIG-T MHEV 103KW (140CV)...,5,140,6.3,MHEV Gasolina,32700,Nissan Qashqai,Madrid,2024
2,3,NISSAN QASHQAI 1.3 DIG-T MHEV 116KW (158CV) AC...,5,158,6.3,MHEV Gasolina,34300,Nissan Qashqai,Madrid,2024

In [ ]:
df_seguridad.head(3)

,id_seguridad,evaluacion_general,evaluacion_choque_frontal,evaluacion_choque_lateral,evaluacion_barrera_lateral,evaluacion_vuelco,probabilidad_vuelco,evaluacion_choque_columna,estabilidad_electronica,aviso_choque_frontal,aviso_desvio_carril,quejas,retiradas,investigaciones,anio,marca,version,descripcion,vehiculo_id
0,1,4,4,5,4,4,0.105,5,Standard,No,No,236,1,0,2011,NISSAN,ALTIMA,2011 Nissan Altima 4 DR FWD,357
1,2,4,4,5,4,4,0.105,5,Standard,No,No,240,1,1,2011,NISSAN,ALTIMA HEV,2011 Nissan Altima HEV 4 DR FWD,359
2,3,5,4,5,5,4,0.110,4,Standard,No,No,93,0,3,2011,NISSAN,LEAF,2011 Nissan Leaf 5 HB FWD,367

In [ ]:
df_wallapop.head(3)

,id_wallapop,descripcion,precio,latitud,longitud,ciudad,provincia
0,1,nisan almera tino del 2004 ba por cadena le ve...,2200,40.301646,-3.441828,Arganda del Rey,Madrid
1,2,vendo mi coche en perfecto estado de motor y d...,6500,40.620256,-3.910636,Hoyo de Manzanares,Madrid
2,3,coche usado por mi mujer para ir a trabajar.\n...,11500,40.494190,-3.961537,Villanueva del Pardillo,Madrid

Primero en wallapop

In [ ]:
dicc_provincia = df_provincias.set_index('provincia')['id_provincia'].to_dict()
dicc_provincia

{'Madrid': 1}

In [ ]:
df_wallapop['id_provincia'] = df_wallapop['provincia'].map(dicc_provincia)

In [ ]:
df_wallapop.drop(columns="provincia", inplace=True)

In [ ]:
df_wallapop.head(2)

,id_wallapop,descripcion,precio,latitud,longitud,ciudad,id_provincia
0,1,nisan almera tino del 2004 ba por cadena le ve...,2200,40.301646,-3.441828,Arganda del Rey,1
1,2,vendo mi coche en perfecto estado de motor y d...,6500,40.620256,-3.910636,Hoyo de Manzanares,1

Segundo en nuevos

In [ ]:
dicc_potencia = df_potencias.set_index('potencia')['id_potencia'].to_dict()
dicc_motor = df_motores.set_index('motor')['id_motor'].to_dict()
dicc_modelo = df_modelos.set_index('modelo')['id_modelo'].to_dict()
dicc_anio = df_anios.set_index('anio')['id_anio'].to_dict()

In [ ]:
df_datos_modelos_nuevos['id_provincia'] = df_datos_modelos_nuevos['provincia'].map(dicc_provincia)
df_datos_modelos_nuevos['id_potencia'] = df_datos_modelos_nuevos['potencia'].map(dicc_potencia)
df_datos_modelos_nuevos['id_motor'] = df_datos_modelos_nuevos['motor'].map(dicc_motor)
df_datos_modelos_nuevos['id_modelo'] = df_datos_modelos_nuevos['modelo'].map(dicc_modelo)
df_datos_modelos_nuevos['id_anio'] = df_datos_modelos_nuevos['anio'].map(dicc_anio)

In [ ]:
df_datos_modelos_nuevos.drop(columns="provincia", inplace=True)
df_datos_modelos_nuevos.drop(columns="potencia", inplace=True)
df_datos_modelos_nuevos.drop(columns="motor", inplace=True)
df_datos_modelos_nuevos.drop(columns="modelo", inplace=True)
df_datos_modelos_nuevos.drop(columns="anio", inplace=True)

In [ ]:
df_datos_modelos_nuevos.head(2)

,id_modelo_nuevo,version,puertas,consumo,precio,id_provincia,id_potencia,id_motor,id_modelo,id_anio
0,1,NISSAN QASHQAI 1.3 DIG-T MHEV 103KW (140CV) AC...,5,6.3,31200,1,1,1,1,14
1,2,NISSAN QASHQAI (O)1.3 DIG-T MHEV 103KW (140CV)...,5,6.3,32700,1,1,1,1,14

Tercero en segunda mano

In [ ]:
dicc_cambio = df_cambio_marcha.set_index('tipo')['id_cambio'].to_dict()

In [ ]:
df_segunda_mano['id_provincia'] = df_segunda_mano['provincia'].map(dicc_provincia)
df_segunda_mano['id_potencia'] = df_segunda_mano['potencia'].map(dicc_potencia)
df_segunda_mano['id_motor'] = df_segunda_mano['motor'].map(dicc_motor)
df_segunda_mano['id_cambio'] = df_segunda_mano['tipo'].map(dicc_cambio)
df_segunda_mano['id_anio'] = df_segunda_mano['anio'].map(dicc_anio)

In [ ]:
df_segunda_mano.drop(columns="provincia", inplace=True)
df_segunda_mano.drop(columns="potencia", inplace=True)
df_segunda_mano.drop(columns="motor", inplace=True)
df_segunda_mano.drop(columns="tipo", inplace=True)
df_segunda_mano.drop(columns="anio", inplace=True)

In [ ]:
df_segunda_mano.head(2)

,id_segunda_mano,version,kilometraje,precio,id_provincia,id_potencia,id_motor,id_cambio,id_anio
0,1,Nissan Qashqai 1.2 DIG-T Acenta 4x2,121649,11480,1,18,3,1,5
1,2,Nissan Juke 1.5dCi Visia,260000,6500,1,15,6,1,2

Por útimo la Seguridad

In [ ]:
dicc_equipamiento = df_equipamientos.set_index('equipamiento')['id_equipamiento'].to_dict()

In [ ]:
df_seguridad['id_anio'] = df_seguridad['anio'].map(dicc_anio)
df_seguridad['id_equipamiento_aviso_choque_front'] = df_seguridad['aviso_choque_frontal'].map(dicc_equipamiento)
df_seguridad['id_equipamiento_aviso_desvio_carril'] = df_seguridad['aviso_desvio_carril'].map(dicc_equipamiento)
df_seguridad['id_equipamiento_estabilidad_electronica'] = df_seguridad['estabilidad_electronica'].map(dicc_equipamiento)

In [ ]:
df_seguridad.drop(columns="anio", inplace=True)
df_seguridad.drop(columns="estabilidad_electronica", inplace=True)
df_seguridad.drop(columns="aviso_choque_frontal", inplace=True)
df_seguridad.drop(columns="aviso_desvio_carril", inplace=True)

In [ ]:
df_seguridad.head(2)

,id_seguridad,evaluacion_general,evaluacion_choque_frontal,evaluacion_choque_lateral,evaluacion_barrera_lateral,evaluacion_vuelco,probabilidad_vuelco,evaluacion_choque_columna,quejas,retiradas,investigaciones,marca,version,descripcion,vehiculo_id,id_anio,id_equipamiento_aviso_choque_front,id_equipamiento_aviso_desvio_carril,id_equipamiento_estabilidad_electronica
0,1,4,4,5,4,4,0.105,5,236,1,0,NISSAN,ALTIMA,2011 Nissan Altima 4 DR FWD,357,1,3,3,1
1,2,4,4,5,4,4,0.105,5,240,1,1,NISSAN,ALTIMA HEV,2011 Nissan Altima HEV 4 DR FWD,359,1,3,3,1

AHORA HABRÍA QUE CREAR LA BASE DE DATOS Y SUS RESPECTIVAS TABLAS

In [ ]:
key= os.getenv("key")

In [ ]:

conexion = psycopg2.connect(
    host="localhost",       
    user="postgres",      
    password=key, 
    port="5432"            
)


conexion.autocommit = True  
cursor = conexion.cursor()

nombre_base_datos = "Vehiculos"

try:
    cursor.execute(sql.SQL("CREATE DATABASE {}").format(sql.Identifier(nombre_base_datos)))
except psycopg2.Error as e:
    print("Error de tipo:", e)

Error de tipo: la base de datos «Vehiculos» ya existe

In [ ]:
try:
    conexion= psycopg2.connect(
        database= "Vehiculos",
        user= "postgres",
        password= key,
        host= "localhost",
        port= "5432"
    )
except:
    print(f"Ocurrió el error {e}")

AHORA LAS TABLAS en POSTRGRESQL

MODELOS

In [ ]:
df_modelos.head(2)

   id_modelo                  modelo
0          1          Nissan Qashqai
1          2  Nissan Qashqai híbrido

In [ ]:
cursor=conexion.cursor()
query_creacion=""" 
CREATE TABLE IF NOT EXISTS modelos(
    id_modelo INT PRIMARY KEY,
    modelo VARCHAR (150)
);

"""


cursor.execute(query_creacion)   
conexion.commit()

In [ ]:
lista_de_tuplas=[]
for fila in df_modelos.values:
    lista_de_tuplas.append(tuple(fila))

In [ ]:
     
query_insercion= "INSERT INTO modelos (id_modelo, modelo) VALUES (%s, %s);"     

cursor.executemany(query_insercion, lista_de_tuplas)          
conexion.commit()

TIPO

In [ ]:
df_cambio_marcha.head(2)

   id_cambio        tipo
0          1      Manual
1          2  Automático

In [ ]:
cursor=conexion.cursor()
query_creacion=""" 
CREATE TABLE IF NOT EXISTS cambio_marcha(
    id_cambio INT PRIMARY KEY,
    tipo VARCHAR (100)
);

"""
cursor.execute(query_creacion)   
conexion.commit()

In [ ]:


lista_de_tuplas=[]
for fila in df_cambio_marcha.values:
    lista_de_tuplas.append(tuple(fila))

In [ ]:
     
query_insercion= "INSERT INTO cambio_marcha (id_cambio, tipo) VALUES (%s, %s);"     

cursor.executemany(query_insercion, lista_de_tuplas)          
conexion.commit()

Motor

In [ ]:
df_motores.head(2)

   id_motor          motor
0         1  MHEV Gasolina
1         2   HEV Gasolina

In [ ]:
cursor=conexion.cursor()
query_creacion=""" 
CREATE TABLE IF NOT EXISTS motores(
    id_motor INT PRIMARY KEY,
    motor VARCHAR (100)
);

"""
cursor.execute(query_creacion)   
conexion.commit()

In [ ]:


lista_de_tuplas=[]
for fila in df_motores.values:
    lista_de_tuplas.append(tuple(fila))

In [ ]:
     
query_insercion= "INSERT INTO motores (id_motor, motor) VALUES (%s, %s);"     

cursor.executemany(query_insercion, lista_de_tuplas)          
conexion.commit()

POTENCIA

In [ ]:
df_potencias.head(2)

   id_potencia  potencia
0            1       140
1            2       158

In [ ]:
cursor=conexion.cursor()
query_creacion=""" 
CREATE TABLE IF NOT EXISTS potencias(
    id_potencia INT PRIMARY KEY,
    potencia INT
);

"""
cursor.execute(query_creacion)   
conexion.commit()

In [ ]:


lista_de_tuplas=[]
for fila in df_potencias.values:
    lista_de_tuplas.append(tuple(fila))

In [ ]:
tuplas_int = [tuple(int(valor) for valor in tupla) for tupla in lista_de_tuplas]

In [ ]:
     
query_insercion= "INSERT INTO potencias (id_potencia, potencia) VALUES (%s, %s);"     

cursor.executemany(query_insercion, tuplas_int)          
conexion.commit()

ANIO

In [ ]:
df_anios.head(2)

   id_anio  anio
0        1  2011
1        2  2012

In [ ]:
cursor=conexion.cursor()
query_creacion=""" 
CREATE TABLE IF NOT EXISTS anios(
    id_anio INT PRIMARY KEY,
    anio INT
);

"""
cursor.execute(query_creacion)   
conexion.commit()

In [ ]:


lista_de_tuplas=[]
for fila in df_anios.values:
    lista_de_tuplas.append(tuple(fila))
tuplas_int = [tuple(int(valor) for valor in tupla) for tupla in lista_de_tuplas]

In [ ]:
     
query_insercion= "INSERT INTO anios (id_anio, anio) VALUES (%s, %s);"     

cursor.executemany(query_insercion, tuplas_int)          
conexion.commit()

PROVINCIAS

In [ ]:
df_provincias.head(1)

   id_provincia provincia
0             1    Madrid

In [ ]:
cursor=conexion.cursor()
query_creacion=""" 
CREATE TABLE IF NOT EXISTS provincias(
    id_provincia INT PRIMARY KEY,
    provincia VARCHAR (100)
);

"""
cursor.execute(query_creacion)   
conexion.commit()

In [ ]:


lista_de_tuplas=[]
for fila in df_provincias.values:
    lista_de_tuplas.append(tuple(fila))

In [ ]:
     
query_insercion= "INSERT INTO provincias (id_provincia, provincia) VALUES (%s, %s);"     

cursor.executemany(query_insercion, lista_de_tuplas)          
conexion.commit()

EQUIPAMIENTOS

In [ ]:
df_equipamientos.head(2)

   id_equipamiento equipamiento
0                1     Standard
1                2     Optional

In [ ]:
cursor=conexion.cursor()
query_creacion=""" 
CREATE TABLE IF NOT EXISTS equipamientos(
    id_equipamiento INT PRIMARY KEY,
    equipamiento VARCHAR (100)
);

"""
cursor.execute(query_creacion)   
conexion.commit()

In [ ]:


lista_de_tuplas=[]
for fila in df_equipamientos.values:
    lista_de_tuplas.append(tuple(fila))

In [ ]:
     
query_insercion= "INSERT INTO equipamientos (id_equipamiento, equipamiento) VALUES (%s, %s);"     

cursor.executemany(query_insercion, lista_de_tuplas)          
conexion.commit()

AHORA TOCAN LAS GRANDES

WALLAPOP

In [ ]:
df_wallapop.head(2)

,id_wallapop,descripcion,precio,latitud,longitud,ciudad,id_provincia
0,1,nisan almera tino del 2004 ba por cadena le ve...,2200,40.301646,-3.441828,Arganda del Rey,1
1,2,vendo mi coche en perfecto estado de motor y d...,6500,40.620256,-3.910636,Hoyo de Manzanares,1

In [ ]:
cursor=conexion.cursor()
query_creacion=""" 
CREATE TABLE IF NOT EXISTS wallapop(
    id_wallapop INT PRIMARY KEY,
    descripcion VARCHAR (1000),
    precio INT,
    latitud NUMERIC,
    longitud NUMERIC,
    ciudad VARCHAR(200),
    id_provincia INT,
    FOREIGN KEY (id_provincia) REFERENCES provincias(id_provincia) ON DELETE RESTRICT ON UPDATE CASCADE
);
"""
cursor.execute(query_creacion)   
conexion.commit()

In [ ]:


lista_de_tuplas=[]
for fila in df_wallapop.values:
    lista_de_tuplas.append(tuple(fila))

In [ ]:
     
query_insercion= "INSERT INTO wallapop (id_wallapop,descripcion,precio,latitud, longitud, ciudad,id_provincia ) VALUES (%s, %s,%s, %s,%s, %s, %s);"     

cursor.executemany(query_insercion, lista_de_tuplas)          
conexion.commit()

SEGURIDAD

In [ ]:
df_seguridad.head(2)

,id_seguridad,evaluacion_general,evaluacion_choque_frontal,evaluacion_choque_lateral,evaluacion_barrera_lateral,evaluacion_vuelco,probabilidad_vuelco,evaluacion_choque_columna,quejas,retiradas,investigaciones,marca,version,descripcion,vehiculo_id,id_anio,id_equipamiento_aviso_choque_front,id_equipamiento_aviso_desvio_carril,id_equipamiento_estabilidad_electronica
0,1,4,4,5,4,4,0.105,5,236,1,0,NISSAN,ALTIMA,2011 Nissan Altima 4 DR FWD,357,1,3,3,1
1,2,4,4,5,4,4,0.105,5,240,1,1,NISSAN,ALTIMA HEV,2011 Nissan Altima HEV 4 DR FWD,359,1,3,3,1

In [ ]:
df_equipamientos.head(2)

   id_equipamiento equipamiento
0                1     Standard
1                2     Optional

In [ ]:
cursor=conexion.cursor()
query_creacion=""" 
CREATE TABLE IF NOT EXISTS seguridad(
    id_seguridad INT PRIMARY KEY,
    evaluacion_general INT,
    evaluacion_choque_frontal INT,
    evaluacion_choque_lateral INT,
    evaluacion_barrera_lateral INT,
    evaluacion_vuelco INT,
    probabilidad_vuelco NUMERIC,
    evaluacion_choque_columna INT,
    quejas INT,
    retiradas INT,
    investigaciones INT,
    marca VARCHAR (100),
    version VARCHAR (200),
    descripcion VARCHAR (300),
    vehiculo_id INT,
    id_anio INT,
    id_equipamiento_aviso_choque_front INT,
    id_equipamiento_aviso_desvio_carril INT,
    id_equipamiento_estabilidad_electronica INT,
    FOREIGN KEY (id_anio) REFERENCES anios(id_anio) ON DELETE RESTRICT ON UPDATE CASCADE,
    FOREIGN KEY (id_equipamiento_aviso_choque_front) REFERENCES equipamientos(id_equipamiento) ON DELETE RESTRICT ON UPDATE CASCADE,
    FOREIGN KEY (id_equipamiento_aviso_desvio_carril) REFERENCES equipamientos(id_equipamiento) ON DELETE RESTRICT ON UPDATE CASCADE,
    FOREIGN KEY (id_equipamiento_estabilidad_electronica) REFERENCES equipamientos(id_equipamiento) ON DELETE RESTRICT ON UPDATE CASCADE
);
"""
cursor.execute(query_creacion)   
conexion.commit()

In [ ]:


lista_de_tuplas=[]
for fila in df_seguridad.values:
    lista_de_tuplas.append(tuple(fila))

In [ ]:
     
query_insercion= "INSERT INTO seguridad (id_seguridad,evaluacion_general,evaluacion_choque_frontal,evaluacion_choque_lateral,evaluacion_barrera_lateral,evaluacion_vuelco,probabilidad_vuelco,evaluacion_choque_columna,quejas,retiradas,investigaciones, marca, version,descripcion,vehiculo_id, id_anio,id_equipamiento_aviso_choque_front,id_equipamiento_aviso_desvio_carril,id_equipamiento_estabilidad_electronica) VALUES (%s, %s,%s, %s,%s, %s, %s,%s, %s,%s, %s,%s, %s, %s,%s, %s, %s,%s, %s);"     

cursor.executemany(query_insercion, lista_de_tuplas)          
conexion.commit()

SEGUNDA MANO

In [ ]:
df_segunda_mano.head(2)

,id_segunda_mano,version,kilometraje,precio,id_provincia,id_potencia,id_motor,id_cambio,id_anio
0,1,Nissan Qashqai 1.2 DIG-T Acenta 4x2,121649,11480,1,18,3,1,5
1,2,Nissan Juke 1.5dCi Visia,260000,6500,1,15,6,1,2

In [ ]:
cursor=conexion.cursor()
query_creacion=""" 
CREATE TABLE IF NOT EXISTS segunda_mano(
    id_segunda_mano INT PRIMARY KEY,
    version VARCHAR(200),
    kilometraje INT,
    precio INT,
    id_provincia INT,
    id_potencia INT,
    id_motor INT,
    id_cambio INT,
    id_anio INT,
    FOREIGN KEY (id_provincia) REFERENCES provincias(id_provincia) ON DELETE RESTRICT ON UPDATE CASCADE,
    FOREIGN KEY (id_potencia) REFERENCES potencias(id_potencia) ON DELETE RESTRICT ON UPDATE CASCADE,
    FOREIGN KEY (id_motor) REFERENCES motores(id_motor) ON DELETE RESTRICT ON UPDATE CASCADE,
    FOREIGN KEY (id_cambio) REFERENCES cambio_marcha(id_cambio) ON DELETE RESTRICT ON UPDATE CASCADE,
    FOREIGN KEY (id_anio) REFERENCES anios(id_anio) ON DELETE RESTRICT ON UPDATE CASCADE
);
"""
cursor.execute(query_creacion)   
conexion.commit()

In [ ]:


lista_de_tuplas=[]
for fila in df_segunda_mano.values:
    lista_de_tuplas.append(tuple(fila))

In [ ]:
     
query_insercion= "INSERT INTO segunda_mano (id_segunda_mano,version,kilometraje,precio,id_provincia,id_potencia,id_motor,id_cambio,id_anio) VALUES (%s, %s,%s, %s,%s, %s, %s,%s,%s);"     

cursor.executemany(query_insercion, lista_de_tuplas)          
conexion.commit()

NUEVOS

In [ ]:
df_datos_modelos_nuevos.head(2)

,id_modelo_nuevo,version,puertas,consumo,precio,id_provincia,id_potencia,id_motor,id_modelo,id_anio
0,1,NISSAN QASHQAI 1.3 DIG-T MHEV 103KW (140CV) AC...,5,6.3,31200,1,1,1,1,14
1,2,NISSAN QASHQAI (O)1.3 DIG-T MHEV 103KW (140CV)...,5,6.3,32700,1,1,1,1,14

In [ ]:
cursor=conexion.cursor()
query_creacion=""" 
CREATE TABLE IF NOT EXISTS modelos_nuevos(
    id_modelo_nuevo INT PRIMARY KEY,
    version VARCHAR(400),
    puertas INT,
    consumo NUMERIC,
    precio INT,
    id_provincia INT,
    id_potencia INT,
    id_motor INT,
    id_modelo INT,
    id_anio INT,
    FOREIGN KEY (id_provincia) REFERENCES provincias(id_provincia) ON DELETE RESTRICT ON UPDATE CASCADE,
    FOREIGN KEY (id_potencia) REFERENCES potencias(id_potencia) ON DELETE RESTRICT ON UPDATE CASCADE,
    FOREIGN KEY (id_motor) REFERENCES motores(id_motor) ON DELETE RESTRICT ON UPDATE CASCADE,
    FOREIGN KEY (id_modelo) REFERENCES modelos(id_modelo) ON DELETE RESTRICT ON UPDATE CASCADE,
    FOREIGN KEY (id_anio) REFERENCES anios(id_anio) ON DELETE RESTRICT ON UPDATE CASCADE
);
"""
cursor.execute(query_creacion)   
conexion.commit()

In [ ]:


lista_de_tuplas=[]
for fila in df_datos_modelos_nuevos.values:
    lista_de_tuplas.append(tuple(fila))

In [ ]:
     
query_insercion= "INSERT INTO modelos_nuevos (id_modelo_nuevo,version,puertas,consumo,precio,id_provincia,id_potencia,id_motor,id_modelo,id_anio) VALUES (%s, %s,%s, %s,%s, %s, %s,%s,%s,%s);"     

cursor.executemany(query_insercion, lista_de_tuplas)          
conexion.commit()